Revit 2027 API
RevitLinkGraphicsSettings.GetViewDetailLevelType Method
 The view detail level type of RevitLinkGraphicsSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkVisibility GetViewDetailLevelType()
Public Function GetViewDetailLevelType As LinkVisibility
public:
LinkVisibility GetViewDetailLevelType()
member GetViewDetailLevelType : unit -> LinkVisibility
Return Value
LinkVisibility
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace